{
  "add_cross_attention": false,
  "architectures": [
    "DNABertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "auto_map": {
    "AutoConfig": "configuration_bert.BertConfig",
    "AutoModel": "dnabert_layer.BertModel",
    "AutoModelForMaskedLM": "dnabert_layer.BertForMaskedLM",
    "AutoModelForPreTraining": "dnabert_layer.BertForPreTraining",
    "AutoModelForSequenceClassification": "dnabert_layer.DNABertForSequenceClassification"
  },
  "bos_token_id": 0,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": null,
  "eos_token_ids": 0,
  "finetuning_task": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_decoder": false,
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "num_rnn_layer": 1,
  "output_past": true,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "pruned_heads": {},
  "rnn": "lstm",
  "rnn_dropout": 0.0,
  "rnn_hidden": 768,
  "split": 10,
  "tie_word_embeddings": true,
  "torchscript": false,
  "transformers_version": "5.10.2",
  "type_vocab_size": 2,
  "use_bfloat16": false,
  "use_cache": false,
  "vocab_size": 4101
}
